#+TITLE: Day 5, Part 2

#+begin_src jq :in-file d5test.txt :cmd-line -nR
12 as $answer |
[ inputs/" -> " | map(split(",") | map(tonumber)) ]
  | map(if .[0][0] == .[1][0] or .[0][1] == .[1][1] then
          [(transpose | [[range(first | min; first | max + 1)], [range(last | min; last | max + 1)]] | combinations)]
        else ([ . as $i | transpose |
                ([range(first | min; first | max + 1)] | if $i[0][0] > $i[1][0] then reverse else . end),
                ([range(last | min; last | max + 1)] | if $i[0][1] > $i[1][1] then reverse else . end)]
               | transpose
             )
        end)
 | flatten(1) | group_by(.) | map(select(length > 1)) | flatten(1) | unique | length == $answer
#+end_src

#+RESULTS:
: true

#+begin_src jq :in-file d5input.txt :cmd-line -nR
[ inputs/" -> " | map(split(",") | map(tonumber)) ]
  | map(if .[0][0] == .[1][0] or .[0][1] == .[1][1] then
          [(transpose | [[range(first | min; first | max + 1)], [range(last | min; last | max + 1)]] | combinations)]
        else ([ . as $i | transpose |
                ([range(first | min; first | max + 1)] | if $i[0][0] > $i[1][0] then reverse else . end),
                ([range(last | min; last | max + 1)] | if $i[0][1] > $i[1][1] then reverse else . end)]
               | transpose
             )
        end)
 | flatten(1) | group_by(.) | map(select(length > 1)) | flatten(1) | unique | length
#+end_src

#+RESULTS:
: 19663
